Q1. List any five functions of the pandas library with execution.

In [1]:
dict1 = {"marks":[30,45,6,78,90,100,22,44,66,80]}
import pandas as pd
df = pd.DataFrame(dict1)
df

   marks
0     30
1     45
2      6
3     78
4     90
5    100
6     22
7     44
8     66
9     80

In [2]:
df['marks'].mean()
df['marks'].median()
df['marks'].sum()
df['marks'].cumsum()

0     30
1     75
2     81
3    159
4    249
5    349
6    371
7    415
8    481
9    561
Name: marks, dtype: int64

Q2. Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the
DataFrame with a new index that starts from 1 and increments by 2 for each row.

In [3]:
df1 = {"A":[1,2,3,4],"B":[2,4,6,8],"C":[3,5,6,7]}
df1 = pd.DataFrame(df1)
# df1.set_index()
new_index = range(1, 2 * len(df1) + 1, 2)
df_reindexed = df1.set_index(pd.Index(new_index))

In [4]:
df_reindexed

   A  B  C
1  1  2  3
3  2  4  5
5  3  6  6
7  4  8  7

Q3. You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that
iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The
function should print the sum to the console.

For example, if the 'Values' column of df contains the values [10, 20, 30, 40, 50], your function should
calculate and print the sum of the first three values, which is 60.

In [5]:
df2 = pd.DataFrame({"values":[10,20,30 ,40,50]})

In [6]:
df2['values'][:3].sum()

60

Q4. Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column
'Word_Count' that contains the number of words in each row of the 'Text' column.

In [7]:
pd.set_option('display.max_colwidth', 1000)
df2 = pd.DataFrame({"text":["For job placements and assistance: Enroll in our job assurance program for resume building, mock interviews, job referrals, and an assured job opportunity. Opt for our job assistance course for resume building, mock interviews, and job alerts (job assurance not included)."]})

In [8]:
df2

                                                                                                                                                                                                                                                                               text
0  For job placements and assistance: Enroll in our job assurance program for resume building, mock interviews, job referrals, and an assured job opportunity. Opt for our job assistance course for resume building, mock interviews, and job alerts (job assurance not included).

In [9]:
df2['word_count'] = df2['text'].apply(len)

In [10]:
df2

,text,word_count
0,"For job placements and assistance: Enroll in our job assurance program for resume building, mock interviews, job referrals, and an assured job opportunity. Opt for our job assistance course for resume building, mock interviews, and job alerts (job assurance not included).",272

Q5. How are DataFrame.size() and DataFrame.shape() different?

In [11]:
df1.shape
# DataFrame.shape:

# DataFrame.shape returns a tuple representing the dimensions of the DataFrame.
# The tuple contains two elements: the number of rows and the number of columns.

(4, 3)

In [12]:
df1.size

# DataFrame.size:

# DataFrame.size returns the total number of elements in the DataFrame.
# It calculates the size by multiplying the number of rows by the number of columns.

12

Q6. Which function of pandas do we use to read an excel file?

In [13]:
df4 = pd.read_excel("Book1.csv.xlsx")

In [14]:
df4

  anshika   446 parveen ji
0   arpita  401  sanjay ji
1     isha  437   vijay ji

Q7. You have a Pandas DataFrame df that contains a column named 'Email' that contains email
addresses in the format 'username@domain.com'. Write a Python function that creates a new column
'Username' in df that contains only the username part of each email address.

The username is the part of the email address that appears before the '@' symbol. For example, if the
email address is 'john.doe@example.com', the 'Username' column should contain 'john.doe'. Your
function should extract the username from each email address and store it in the new 'Username'
column.

In [15]:
data = {"emails" : ["abc123@gmail.com","def34@gmail.com","vidhi2821426@gmail.com"]}
df5 = pd.DataFrame(data)

In [16]:
df5

                   emails
0        abc123@gmail.com
1         def34@gmail.com
2  vidhi2821426@gmail.com

In [17]:
df5['username']=df5['emails'].str.split("@gmail.com")

In [18]:
df5

                   emails          username
0        abc123@gmail.com        [abc123, ]
1         def34@gmail.com         [def34, ]
2  vidhi2821426@gmail.com  [vidhi2821426, ]

Q8. You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects
all rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. The
function should return a new DataFrame that contains only the selected rows.
For example, if df contains the following values:
    
A B C

0 3 5 1

1 8 2 7

2 6 9 4

3 2 3 5

4 9 1 2

In [19]:
df6 = pd.DataFrame({"A":[3,8,6,2,9],"B":[5,2,9,3,1],"C":[1,7,4,5,2]})

In [20]:
df6

   A  B  C
0  3  5  1
1  8  2  7
2  6  9  4
3  2  3  5
4  9  1  2

In [21]:
df6[(df6['A']>5) & (df6['B']<10)]

   A  B  C
1  8  2  7
2  6  9  4
4  9  1  2

In [22]:
def dtf(df):
    return (df[(df['A']>5) & (df['B']<10)])

In [23]:
dtf(df6)

   A  B  C
1  8  2  7
2  6  9  4
4  9  1  2

Q9. Given a Pandas DataFrame df with a column 'Values', write a Python function to calculate the mean,
median, and standard deviation of the values in the 'Values' column.

In [24]:
df2 = pd.DataFrame({"values":[10,20,30 ,40,50]})
df2['values'].mean()
df2['values'].median()
df2['values'].std()

15.811388300841896

Q10. Given a Pandas DataFrame df with a column 'Sales' and a column 'Date', write a Python function to
create a new column 'MovingAverage' that contains the moving average of the sales for the past 7 days
for each row in the DataFrame. The moving average should be calculated using a window of size 7 and
should include the current day.

In [25]:
df8 = pd.DataFrame({
    "sales":[100,100,200,200,300,300,300,400,400,500,500,600,300,900,800],
})
start_date = '2022-01-01'
end_date = '2023-01-01'
num_dates = 15

random_dates = pd.date_range(start=start_date, end=end_date, periods=num_dates)
df8['dates'] = random_dates

In [26]:
df8.dtypes

sales             int64
dates    datetime64[ns]
dtype: object

In [34]:
df8['dates']=df8['dates'].dt.date

In [35]:
df8

    sales       dates
0     100  2022-01-01
1     100  2022-01-27
2     200  2022-02-22
3     200  2022-03-20
4     300  2022-04-15
5     300  2022-05-11
6     300  2022-06-06
7     400  2022-07-02
8     400  2022-07-28
9     500  2022-08-23
10    500  2022-09-18
11    600  2022-10-14
12    300  2022-11-09
13    900  2022-12-05
14    800  2023-01-01

In [38]:
# Assume df has a datetime index
df8['rolling_mean'] = df8['sales'].rolling(window=7).mean()

In [39]:
df8['rolling_mean']

0            NaN
1            NaN
2            NaN
3            NaN
4            NaN
5            NaN
6     214.285714
7     257.142857
8     300.000000
9     342.857143
10    385.714286
11    428.571429
12    428.571429
13    514.285714
14    571.428571
Name: rolling_mean, dtype: float64

Q11. You have a Pandas DataFrame df with a column 'Date'. Write a Python function that creates a new
column 'Weekday' in the DataFrame. The 'Weekday' column should contain the weekday name (e.g.
Monday, Tuesday) corresponding to each date in the 'Date' column.

For example, if df contains the following values:
Date
0 2023-01-01
1 2023-01-02
2 2023-01-03
3 2023-01-04
4 2023-01-05
Your function should create the following DataFrame:

Date Weekday
0 2023-01-01 Sunday
1 2023-01-02 Monday
2 2023-01-03 Tuesday
3 2023-01-04 Wednesday
4 2023-01-05 Thursday
The function should return the modified DataFrame.

In [40]:
df9 = pd.DataFrame({'Date':
[ '2023-01-01',
 '2023-01-02',
 '2023-01-03',' 2023-01-04',
 '2023-01-05']})

In [48]:
df9['Date']=pd.to_datetime(df9['Date'])

In [49]:
df9.dtypes

Date    datetime64[ns]
dtype: object

In [52]:
df9['dayName']=df9['Date'].dt.day_name()

In [53]:
df9

        Date    dayName
0 2023-01-01     Sunday
1 2023-01-02     Monday
2 2023-01-03    Tuesday
3 2023-01-04  Wednesday
4 2023-01-05   Thursday

Q12. Given a Pandas DataFrame df with a column 'Date' that contains timestamps, write a Python
function to select all rows where the date is between '2023-01-01' and '2023-01-31'.

In [56]:
start_date = '2023-01-01'
end_date = '2023-01-31'
random_dates = pd.date_range(start=start_date, end=end_date)
random_dates

DatetimeIndex(['2023-01-01', '2023-01-02', '2023-01-03', '2023-01-04',
               '2023-01-05', '2023-01-06', '2023-01-07', '2023-01-08',
               '2023-01-09', '2023-01-10', '2023-01-11', '2023-01-12',
               '2023-01-13', '2023-01-14', '2023-01-15', '2023-01-16',
               '2023-01-17', '2023-01-18', '2023-01-19', '2023-01-20',
               '2023-01-21', '2023-01-22', '2023-01-23', '2023-01-24',
               '2023-01-25', '2023-01-26', '2023-01-27', '2023-01-28',
               '2023-01-29', '2023-01-30', '2023-01-31'],
              dtype='datetime64[ns]', freq='D')

Q13. To use the basic functions of pandas, what is the first and foremost necessary library that needs to
be imported?

the **import pandas as pd** needs to be imported first